tests/performance/article.yml
config:
  target: "http://localhost:23000"
  http:
    pool: 10
  phases:
    - duration: 20
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: Test articles
    flow:
      - get:
          url: "/api/articles"